# SQLITE WITH PYTHON

# DATABASE-------4th Feb

Database are those locations where number of tables could be created and all those tables are logical reated to each other that paticular memory space known as database.

To handle the database, we need certain technologies that technology is basically Data Base Mannagement System.

Data Base Mangement System is one of the software and technology through which we can create, manage, maintain, sreach the data and delete the entire databases.

Inside the database, we can keep the records in the form of tables. The tables are creation of rows into columns. We need to access these databases.

# What are the 3 types of SQL?

SQL Commands can be grouped into following depending on their functionality: 
1. DDL (Data Definition Language) ----create, alter, drop
2. DML (Data Manipulation Language)----select, insert, delete 
3. TCL or DCL (Transaction Control Language or Data Control Language.) -----commit, rollback, grant/evoke

###### Basically, there are two types of DBMSs: relational and non-relational, also referred to as SQL and NoSQL respectively.

ReLtionL Data Base Management System: means here we can built up entire data base into Rows and Columns. There are various software such as SqLite, MySQL, Oracla, MS_SQL Server, Postgre SQL server etc. These all are relational database management system. where one can work with rows and columns. Here table like structure, we are having.

Non-Relational Data Base Management System: These type of Data Base Management System do not have structure in the form of rows and columns. There are into the form of NoSQL form. Generally we called NoSQL DBMSs.
Example: MongoDB, Oracle NoSQL Database, Objectivity InfiniteGraph, Amazon dynamodb, cassandra, ElasticSreach etc. 

we do use such type of software, whenever we are draging out the data or we need to use out the data from social media data. There are into video, image, voice type video data, emojies, or some textual data or mixture of data are required.

# Link to know how to start sql with python in jupyter

https://towardsdatascience.com/starting-with-sql-in-python-948e529586f2

Step 1 — Importing SQLite and Pandas
To start, we will need to import SQLite into our Jupyter notebook.

-->import sqlite3
-->import pandas as pd

Step 2 — Connecting your database
Using the connect() function allows you to create a database in your environment. This helps users name their database to be called in Python later on. The connect() function maintains the connection while you are working with the database.

An important thing to note is that while you are connected to the database, other users will not be able to access it at the same time. This is why it is essential to close() the connection when you are done(I’ll discuss closing a connection near the end).

-->sql_connect = sqlite3.connect('factbook.db')

Step 3 — Cursor Object

The cursor() function is used to assist with executing our SQL queries.

cursor = sql_connect.cursor()
It is important that you use the cursor() to return a Cursor instance corresponding to the database we want to query.

# Tables

Tables are database objects that contain all the data in a database. In tables, data is logically organized in a row-and-column format similar to a spreadsheet. Each row represents a unique record, and each column represents a field in the record.

# Rows Vs Cloumns

# What is row vs column in SQL?


Tables contain rows and columns, where the rows are known as records and the columns are known as fields.

A row, or record, is also known as a tuple. The columns in a table is a field and is also referred to as an attribute.

A row is a horizontal alignment of data, while a column is vertical. Data in a row contains information that describes a single entity, while data in a column describes a field of information all entities possess. Objects placed in a row typically face forward, while objects in a columns are aligned head to tail.

rows are alo known as

In [ ]:
DBMS are basically of two types on the basiis of license:
    
    1. Open Source ----- SQLite, MySQL, postgreSQL
    
    2. Proprietor ----Need to purchase the license---- orcale, MS_SQL Server

# SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a non-standard variant of the SQL query language.

# Is sqlite3 the same as SQL?

SQL is standard which specifies how relational schema is created, data is inserted or updated in relations, transactions are started and stopped, etc. SQLite is file-based. It is different from other SQL databases because unlike most other SQL databases, SQLite does not have separate server process.

# Do you need a server for SQLite?

SQLite is serverless as it doesn't need a different server process or system to operate. SQLite facilitates we to work on multiple databases on the same session simultaneously, thus making it flexible.

# Can SQLite be access by multiple processes?

SQLite allows multiple processes to have the database file open at once, and for multiple processes to read the database at once. When any process wants to write, it must lock the entire database file for the duration of its update. But that normally only takes a few milliseconds.

In [1]:
import sqlite3

working with database using SQL (Structured Query Language)

1. Create a connection object.
2. Form the connection object,  create a cursor object.
3. Using the cursor object, call the execute method with create table query as the parameter.

# Create Database

In [1]:
#Student_Feb_database will be created in Jupyter notebook Home.

# First connection object
import sqlite3
dbconn = sqlite3.connect('Student_Feb_database.db')

###### Cursor:

==> A cursor in SQL is a temporary work area created in system memory when a SQL statement is executed.
==> A SQL cursor is a set of rows together with a pointer that identifies a current row.
==> It is a database object to retrive data from a result set one row at a time.

# Create cursor object from connection to make temporary memmory area to execute SQL query

In [2]:
# Create cursor object from connection to make temporary memmory area to execute SQL query

cur = dbconn.cursor()

# Create table in Student_Feb_database

# SQL data types:----
    
   1. integer ----- numeric values
   2. real ------ decimal values
   3. text ------ character values
   4. char(20)  --- character values

In [3]:
cur.execute("create table student (sid int primary key, name text, age int)")

# Insert data in Student_Feb_database

In [4]:
cur.execute("insert into Student(sid,name,age) values(1, 'Andrea', 12)")
dbconn.commit(); # no need to keep semi colon in jupyter

In [5]:
cur.execute("insert into Student(sid,name,age) values(2, 'Smith', 11)")
dbconn.commit();

In [6]:
cur.execute("insert into Student(sid,name,age) values(3, 'Clara', 11)")
dbconn.commit();

In [7]:
rows = cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)

In [8]:
cur.execute("insert into Student(sid,name,age) values(4, 'Jhon', 9)")
dbconn.commit();

In [9]:
cur.execute("insert into Student(sid,name,age) values(5, 'Jack', 8)")
dbconn.commit();

In [10]:
cur.execute("insert into Student(sid,name,age) values(6, 'Kiara', 15)")
dbconn.commit();

In [11]:
cur.execute("insert into Student(sid,name,age) values(7, 'Jade', 15)")
dbconn.commit();

In [12]:
rows = cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 15)
(7, 'Jade', 15)

In [13]:
cur.execute("select name, age, concate(name,'',age) AS 'NA' from student")

rows = cur.execute("select * from student")
for i in rows:
    print(i)

OperationalError: no such function: concate

In [14]:
cur.execute("SELECT name, age, name || ' ' || age AS 'NA' FROM student")

rows = cur.execute("SELECT * FROM student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 15)
(7, 'Jade', 15)

==> Primary Key means : it should be unique or not null---data should be filled, we cannot leave empty.
    ==> primary key should be only one. Blank space also cannnot keep for primary key. If still we are doing it then we will get error.
    
NOTE:Here we need to hold the data that#s why we are using the rows.

In [15]:
rows = cur.execute("select * from student where sid=1")
for i in rows:
    print(i)

(1, 'Andrea', 12)

In [16]:
rows = cur.execute("select * from student where sid=2")
for i in rows:
    print(i)

(2, 'Smith', 11)

In [17]:
rows = cur.execute("select * from student where sid=6")
for i in rows:
    print(i)

(6, 'Kiara', 15)

In [18]:
rows = cur.execute("select * from student where name='Jhon'")
for i in rows:
    print(i)

(4, 'Jhon', 9)

In [19]:
rows = cur.execute("select * from student where age = 9")

for i in rows:
    print(i)

(4, 'Jhon', 9)

In [20]:
rows = cur.execute("select * from student where age = 15")

for i in rows:
    print(i)

(6, 'Kiara', 15)
(7, 'Jade', 15)

In [21]:
rows = cur.execute("select sid from student")
for i in rows:
    print(i)

(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
(7,)

In [22]:
rows = cur.execute("select sid, name from student")
for i in rows:
    print(i)

(1, 'Andrea')
(2, 'Smith')
(3, 'Clara')
(4, 'Jhon')
(5, 'Jack')
(6, 'Kiara')
(7, 'Jade')

In [23]:
rows = cur.execute("select sid, age from student")
for i in rows:
    print(i)

(1, 12)
(2, 11)
(3, 11)
(4, 9)
(5, 8)
(6, 15)
(7, 15)

In [24]:
rows =cur.execute("select name from student")
for i in rows:
    print(i)

('Andrea',)
('Smith',)
('Clara',)
('Jhon',)
('Jack',)
('Kiara',)
('Jade',)

In [25]:
rows =cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 15)
(7, 'Jade', 15)

# Where Clause:

The WHERE clause is used to filter records. It is used to extract only those records that fulfill a specified condition.

In [26]:
rows = cur.execute("select name from student where age = 11")
for i in rows:
    print(i)

('Smith',)
('Clara',)

In [27]:
rows = cur.execute("select name, sid, age from student where age = 11")
for i in rows:
    print(i)

('Smith', 2, 11)
('Clara', 3, 11)

In [28]:
rows = cur.execute("select * from student where age = 11")
for i in rows:
    print(i)

(2, 'Smith', 11)
(3, 'Clara', 11)

In [29]:
rows = cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 15)
(7, 'Jade', 15)

# IN Operator:

The IN command allows you to specify multiple values in a WHERE clause. The IN operator is a shorthand for multiple OR conditions.

In [30]:
rows = cur.execute("select * from student where age IN(8,9,11)") # we can keep more than one vale or use IN when required to call multiple values.
for i in rows:
    print(i)

(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)

In [31]:
rows = cur.execute("select * from student where sid IN(4,5)")
for i in rows:
    print(i)

(4, 'Jhon', 9)
(5, 'Jack', 8)

In [32]:
rows = cur.execute("select * from student where name IN('Jhon','Kiara')")
for i in rows:
    print(i)

(4, 'Jhon', 9)
(6, 'Kiara', 15)

# AND, OR & NOT OPerator:

The WHERE clause can be combined with AND, OR, and NOT operators.

The AND and OR operators are used to filter records based on more than one condition:

The AND operator displays a record if all the conditions separated by AND are TRUE.

The OR operator displays a record if any of the conditions separated by OR is TRUE.

The NOT operator displays a record if the condition(s) is NOT TRUE.

In [33]:
rows = cur.execute("select * from student where name = 'Clara' and age = 11")

for i in rows:
    print(i)

(3, 'Clara', 11)

Logical OPerator : only take or understand Zero-Flase and One-True
    
  1. AND 
ip 1              ip2   =    op
0-Flase         0-Flase =  0-Flase
0-Flase         1-True  =  0-Flase
1-True          0-Flase =  0-Flase
1-True          1-True  =  1-True

In AND operator will be working or provinding result when both inputs are True.

  2. OR : here we can consider interpretation of + sing between two inputs
    
ip 1              ip2   =    op
0-Flase         0-Flase =  0-Flase
0-Flase         1-True  =  1-True
1-True          0-Flase =  1-True
1-True          1-True  =  1-True

In OR operator will be working or provinding result when any inputs are True.
    
  3. NOT: Providing the data in reversal order
    
The truth table for the NOT operation is:
    
ip      =    op
0-Flase =   1-True
1-True  =  0-Flase

In [34]:
rows = cur.execute("select * from student where name='Jhon' or age = 15")
for i in rows:
    print(i) # poping resulting if any condition is true or only one condition is true.

(4, 'Jhon', 9)
(6, 'Kiara', 15)
(7, 'Jade', 15)

In [35]:
rows = cur.execute("select * from student where sid NOT in(2,4,5)")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(3, 'Clara', 11)
(6, 'Kiara', 15)
(7, 'Jade', 15)

In [36]:
rows = cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 15)
(7, 'Jade', 15)

In [37]:
cur.execute("insert into Student(sid,name,age) values(8, 'Jack', 18)")
dbconn.commit();

In [38]:
rows = cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 15)
(7, 'Jade', 15)
(8, 'Jack', 18)

# Create a new table inside Student_feb_database as student1

cur.execute("create table student1(sid int primary key, name text, age int)")

In [40]:
cur.execute("insert into student1(sid, name, age) values(1,'Andrea',1)")
dbconn.commit();

In [41]:
cur.execute("insert into student1(sid, name, age) values(2,'Smith',11)")
dbconn.commit();

In [42]:
cur.execute("insert into student1(sid, name, age) values(3, 'Jiya', 3)")
dbconn.commit();

In [76]:
rows = cur.execute("select * from student1")
for i in rows:
    print(i)

(1, 'Andrea', 1)
(2, 'Smith', 11)
(3, 'Jiya', 3)
(4, 'Smith', 11)
(5, 'Smith', 11)
(6, 'Smith', 18)
(7, 'Smith', 20)
(8, 'Lisa', 20)
(9, 'Edison', 20)

cur.execute("insert into student1(sid, name, age) values(4, 'Smith', 11)")
dbconn.commit();

In [45]:
cur.execute("insert into student1(sid, name, age) values(5, 'Smith', 11)")
dbconn.commit();

In [46]:
rows = cur.execute("select * from student1")
for i in rows:
    print(i)

(1, 'Andrea', 1)
(2, 'Smith', 11)
(3, 'Jiya', 3)
(4, 'Smith', 11)
(5, 'Smith', 11)

In [47]:
cur.execute("insert into student1(sid, name, age) values(6, 'Smith', 18)")
dbconn.commit();
print(cur.rowcount,"record(s) inserted")

1 record(s) inserted

In [48]:
cur.execute("insert into student1(sid, name, age) values(7, 'Smith', 20)")
dbconn.commit();
print(cur.rowcount,"record(s) inserted")

1 record(s) inserted

# Insert multiple values at a time

In [49]:
cur.execute("insert into student1(sid, name, age) values(8,'Lisa', 20),(9, 'Edison', 20)")
dbconn.commit();
print(cur.rowcount," record(s) inserted")

2  record(s) inserted

In [50]:
rows=cur.execute("select * from student1")

for i in rows:
    print(i)

(1, 'Andrea', 1)
(2, 'Smith', 11)
(3, 'Jiya', 3)
(4, 'Smith', 11)
(5, 'Smith', 11)
(6, 'Smith', 18)
(7, 'Smith', 20)
(8, 'Lisa', 20)
(9, 'Edison', 20)

# Datebasse will be created in the given location

In [51]:
db1=sqlite3.connect("D:/MySQLite_DataBase/student1db.db")

In [52]:
cur1=db1.cursor()

In [53]:
cur1.execute("create table employee(id int, name text, age int)")

# Values can be inter directly without declaring the header of respected item

In [54]:
cur1.execute("insert into employee values(1,'Melina', 32)")
db1.commit();

In [55]:
print(cur1.rowcount, "Rocord(s) inserted")

1 Rocord(s) inserted

In [56]:
results = cur1.execute("select * from employee")

In [57]:
for row in results:
    print(row)

(1, 'Melina', 32)

# Where clause

In [58]:
results = cur.execute("select * from student where sid=1")
for i in results:
    print(i)

(1, 'Andrea', 12)

In [59]:
results = cur.execute("select *from student where sid=2")

for i in results:
    print(i)

(2, 'Smith', 11)

# limit

In [60]:
results = cur.execute("select * from student limit 3")
for i  in results:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)

In [61]:
results = cur.execute("select * from student1 limit 5")
for i in results:
    print(i)

(1, 'Andrea', 1)
(2, 'Smith', 11)
(3, 'Jiya', 3)
(4, 'Smith', 11)
(5, 'Smith', 11)

# fetchall will display all rows----fetch all display the ouput in list

In [62]:
results = cur.execute('select * from student')
results.fetchall()

[(1, 'Andrea', 12),
 (2, 'Smith', 11),
 (3, 'Clara', 11),
 (4, 'Jhon', 9),
 (5, 'Jack', 8),
 (6, 'Kiara', 15),
 (7, 'Jade', 15),
 (8, 'Jack', 18)]

# fetchone

In [66]:
cur1.execute("create table student(id int, name text, age int)")

In [79]:
rows=cur1.execute("select * from student1 where sid=2")
rows.fetchone()

OperationalError: no such column: sid

In [80]:
rows=cur1.execute("select * from student1 where age=11")
rows.fetchone()

In [81]:
rows=cur1.execute("select * from student1 where age=11")
rows.fetchall()

[]

# Order by clause

The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword

In [82]:
results = cur.execute("select * from student order by name")
#The ORDER BY keyword sorts the records in ascending order by default.
results.fetchall()

[(1, 'Andrea', 12),
 (3, 'Clara', 11),
 (5, 'Jack', 8),
 (8, 'Jack', 18),
 (7, 'Jade', 15),
 (4, 'Jhon', 9),
 (6, 'Kiara', 15),
 (2, 'Smith', 11)]

In [83]:
results = cur.execute("select * from student order by name asc")

results.fetchall()

[(1, 'Andrea', 12),
 (3, 'Clara', 11),
 (5, 'Jack', 8),
 (8, 'Jack', 18),
 (7, 'Jade', 15),
 (4, 'Jhon', 9),
 (6, 'Kiara', 15),
 (2, 'Smith', 11)]

In [84]:
cur.execute("create table student4 (id int primary key, name text, marks float)")

In [85]:
cur.execute("insert into student4(id, name, marks) values(121, 'Anu', 60) ")
dbconn.commit();

In [86]:
cur.execute("insert into student4(id, name, marks) values(122, 'Anu', 70) ")
dbconn.commit();

In [87]:
cur.execute("insert into student4(id, name, marks) values(123, 'Rima', 86) ")
dbconn.commit();

In [88]:
cur.execute("insert into student4(id, name, marks) values(124, 'siva', 78) ")
dbconn.commit();

In [89]:
cur.execute("insert into student4(id, name, marks) values(125, 'Rohan', 95) ")
dbconn.commit();

In [90]:
cur.execute("insert into student4(id, name, marks) values(126, 'Mintu', 88) ")
dbconn.commit();

In [91]:
rows= cur.execute("Select * from student4")

for i in rows:
    print(i)

(121, 'Anu', 60.0)
(122, 'Anu', 70.0)
(123, 'Rima', 86.0)
(124, 'siva', 78.0)
(125, 'Rohan', 95.0)
(126, 'Mintu', 88.0)

# Aggregate functions

MIN---find minimumn
MAX---find maximum
AVG---find average
SUM---find sum
COUNT--- count the number of rows

In [92]:
#find the minimumn marks
resultd=cur.execute("Select min(marks) from student4")

for i in results:
    print(i)

(60.0,)

In [93]:
#find maximum marks
resultd=cur.execute("Select max(marks) from student4")

for i in results:
    print(i)

(95.0,)

In [94]:
#find avg marks
resultd=cur.execute("Select avg(marks) from student4")

for i in results:
    print(i)

(79.5,)

In [95]:
rows=cur.execute("select min(age) from student")
for i in rows:
    print(i)

(8,)

In [96]:
rows=cur.execute("select max(age) from student")
for i in rows:
    print(i)

(18,)

In [97]:
rows=cur.execute("select avg(age) from student")
for i in rows:
    print(i)

(12.375,)

In [98]:
rows=cur.execute("select sum(age) from student")
for i in rows:
    print(i)

(99,)

In [99]:
rows=cur.execute("select count(age) from student")
rows.fetchone()

(8,)

# Null values

A field with a NULL value is a field with no value.

If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.

Note: A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been left blank during record creation!

In [100]:
results = cur.execute("select * from student4 where marks is null")

results.fetchall() # here output is blank list as there is no null data

[]

In [101]:
results = cur.execute("select * from student4 where marks is null")

for i in results:
    print(i) # here output is nozt showing as there is no null data

In [102]:
results = cur.execute("select * from student4 where marks is not null")

results.fetchall()

[(121, 'Anu', 60.0),
 (122, 'Anu', 70.0),
 (123, 'Rima', 86.0),
 (124, 'siva', 78.0),
 (125, 'Rohan', 95.0),
 (126, 'Mintu', 88.0)]

# Like operators

The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

 The percent sign (%) represents zero, one, or multiple characters
 The underscore sign (_) represents one, single character

In [103]:
results = cur.execute("select * from student4 where name like 'A%'")
resultd.fetchall()

[(121, 'Anu', 60.0), (122, 'Anu', 70.0)]

In [104]:
results = cur.execute("select * from student4 where name like 'R%'")
for i in results:
    print(i)

(123, 'Rima', 86.0)
(125, 'Rohan', 95.0)

#        LIKE Opera          	     Description


WHERE CustomerName LIKE 'a%'	Finds any values that start with "a"

WHERE CustomerName LIKE '%a'	Finds any values that end with "a"

WHERE CustomerName LIKE '%or%'	Finds any values that have "or" in any position

WHERE CustomerName LIKE '_r%'	Finds any values that have "r" in the second position

WHERE CustomerName LIKE 'a_%'	Finds any values that start with "a" and are at least 2 characters in length

WHERE CustomerName LIKE 'a__%'	Finds any values that start with "a" and are at least 3 characters in length

WHERE ContactName LIKE 'a%o'	Finds any values that start with "a" and ends with "o"

In [105]:
results = cur.execute("select * from student4 where name like '_n%'")
for i in results:
    print(i)

(121, 'Anu', 60.0)
(122, 'Anu', 70.0)

In [106]:
results = cur.execute("select * from student4")
for i in results:
    print(i)

(121, 'Anu', 60.0)
(122, 'Anu', 70.0)
(123, 'Rima', 86.0)
(124, 'siva', 78.0)
(125, 'Rohan', 95.0)
(126, 'Mintu', 88.0)

In [107]:
results = cur.execute("select * from student where name Like '%a%'")
results.fetchall()

[(1, 'Andrea', 12),
 (3, 'Clara', 11),
 (5, 'Jack', 8),
 (6, 'Kiara', 15),
 (7, 'Jade', 15),
 (8, 'Jack', 18)]

In [108]:
results = cur.execute("select * from student4 where name Like '___'")
results.fetchall()

[(121, 'Anu', 60.0), (122, 'Anu', 70.0)]

In [109]:
results = cur.execute("select * from student where name Like '_____'")
results.fetchall()

[(2, 'Smith', 11), (3, 'Clara', 11), (6, 'Kiara', 15)]

In [110]:
results = cur.execute("select * from student where name Like '%j___'")
results.fetchall()

[(4, 'Jhon', 9), (5, 'Jack', 8), (7, 'Jade', 15), (8, 'Jack', 18)]

In [111]:
results = cur.execute("select * from student where name Like '_a%'")
results.fetchall()

[(5, 'Jack', 8), (7, 'Jade', 15), (8, 'Jack', 18)]

In [112]:
results = cur.execute("select * from student4 where name Like '_n%'")
results.fetchall()

[(121, 'Anu', 60.0), (122, 'Anu', 70.0)]

In [113]:
results = cur.execute("select * from student4 where name Like '%n'")
results.fetchall()

[(125, 'Rohan', 95.0)]

In [114]:
results = cur.execute("select * from student4 where name Like '%n%'")
results.fetchall()

[(121, 'Anu', 60.0),
 (122, 'Anu', 70.0),
 (125, 'Rohan', 95.0),
 (126, 'Mintu', 88.0)]

In [115]:
results = cur.execute("select * from student4 where name NOT in('Ro')")
results.fetchall()

[(121, 'Anu', 60.0),
 (122, 'Anu', 70.0),
 (123, 'Rima', 86.0),
 (124, 'siva', 78.0),
 (125, 'Rohan', 95.0),
 (126, 'Mintu', 88.0)]

# Update

In [116]:
sql="Update student set age = 50 where sid=6"
cur.execute(sql)

In [117]:
rows=cur.execute("select * from student")
for i in rows:
    print(i)

(1, 'Andrea', 12)
(2, 'Smith', 11)
(3, 'Clara', 11)
(4, 'Jhon', 9)
(5, 'Jack', 8)
(6, 'Kiara', 50)
(7, 'Jade', 15)
(8, 'Jack', 18)

In [118]:
sql="update student4 set marks=92 where id in(121,122)"
cur.execute(sql)

In [119]:
rows= cur.execute("select * from student4")
for i in rows:
    print(i)

(121, 'Anu', 92.0)
(122, 'Anu', 92.0)
(123, 'Rima', 86.0)
(124, 'siva', 78.0)
(125, 'Rohan', 95.0)
(126, 'Mintu', 88.0)

# Delete : delete any unwanted records

In [120]:
sql = "delete from student4 where id=124"

cur.execute(sql)

results = cur.execute("select * from student4")
results.fetchall()

[(121, 'Anu', 92.0),
 (122, 'Anu', 92.0),
 (123, 'Rima', 86.0),
 (125, 'Rohan', 95.0),
 (126, 'Mintu', 88.0)]

# Drop table Student4

In [121]:
sql = "drop table student4 "
cur.execute(sql)

results = cur.execute("select * from student4")
results.fetchall()

OperationalError: no such table: student4

In [122]:
dbconn.close()

# Adding data in table with csv(common separated values) file directiy

In [123]:
import sqlite3

In [124]:
 db = sqlite3.connect("D:/MySQLite_DataBase/scores_database.db")
    
#Declare cursor

cursor = db.cursor()

In [125]:
#Create table 

cursor.execute("create table scores(gender text, student_id int primary key, marks int)")

In [126]:
#sql = "drop table scores "
#cursor.execute(sql)

#results = cursor.execute("select * from scores")
#results.fetchall()'

In [127]:
# Insert records into the table. (single record inserting)
cursor.execute("insert into scores(gender, student_id, marks) values('Male', 100, 55)")

# Save the records permanently. ( if we don't commit, next time we will not see the records in the table)

db.commit()

# count of the record inserted

print(cursor.rowcount, "Record(s) inserted")

1 Record(s) inserted

# Inserting records from csv file

Unlike open() where you have to close the file with the close() method, the with statement closes the file for you without you telling it to.

This is because the with statement calls 2 built-in methods behind the scene – __enter()__ and __exit()__.

The __exit()__ method closes the file when the operation you specify is done.

In [128]:
# whenever we are opening the file we neeed the handler aand here file is handler

# Handler means through which we can handle the entire file data.

with open('Scores_file.csv', 'r') as file:   #file: is here handler
    total_records=0
    for row in file:
        cursor.execute("insert into scores values(?,?,?)", row.split(","))
        db.commit()
        total_records +=1
print(total_records, 'Records inserted')

17 Records inserted

(?,?,?) : Here question marks denotes the dynamic mode run-time value. we are calling dynamic mode as the ? mark as it will take or consider different types of values.

Here we are entrying string and int and type of values can be insert if we are using the ?.

In [129]:
result = cursor.execute("select * from scores")
for row in result:
    print(row)

('Male', 100, 55)
('Male', 104, 56)
('Male', 105, 78)
('Female', 106, 36)
('Male', 107, 20)
('Female', 108, 98)
('Male', 109, 85)
('Female', 110, 69)
('Male', 111, 46)
('Female', 112, 66)
('Male', 113, 91)
('Male', 114, 48)
('Male', 115, 56)
('Female', 116, 67)
('Male', 117, 78)
('Male', 118, 89)
('Male', 119, 32)
('Female', 120, 44)

In [130]:
#Create table 

cursor.execute("create table scores1(gender text, student_id int primary key, marks int)")

In [131]:
with open('My_score.csv', 'r') as file:   #file: is here handler
    total_records=0
    for row in file:
        cursor.execute("insert into scores1 values(?,?,?)", row.split(","))
        db.commit()
        total_records +=1
print(total_records, 'Records inserted')

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 3, and there are 1 supplied.

In [133]:
with open('My_score.csv', 'r') as file:
    total_records = 0
    for row in file:
        # Split the row into three values using a comma as the delimiter
        values = row.strip().split(",")
        if len(values) == 3:
            cursor.execute("INSERT INTO scores1 VALUES (?, ?, ?)", values)
            db.commit()
            total_records += 1
        else:
            print(f"Skipped a row with incorrect number of values: {row}")

print(total_records, 'Records inserted')

Skipped a row with incorrect number of values: Male;104;56

Skipped a row with incorrect number of values: Male;105;78

Skipped a row with incorrect number of values: Female;106;36

Skipped a row with incorrect number of values: Male;107;20

Skipped a row with incorrect number of values: Female;108;98

Skipped a row with incorrect number of values: Male;109;85

Skipped a row with incorrect number of values: Female;110;69

Skipped a row with incorrect number of values: Male;111;46

Skipped a row with incorrect number of values: Female;112;66

Skipped a row with incorrect number of values: Male;113;91

Skipped a row with incorrect number of values: Male;114;48

Skipped a row with incorrect number of values: Male;115;56

Skipped a row with incorrect number of values: Female;116;67

Skipped a row with incorrect number of values: Male;117;78

Skipped a row with incorrect number of values: Male;118;89

Skipped a row with incorrect number of values: Male;119;32

Skipped a row with incorrect number of values: Female;120;44

0 Records inserted

In [134]:
result = cursor.execute("select * from scores")
for row in result:
    print(row)

('Male', 100, 55)
('Male', 104, 56)
('Male', 105, 78)
('Female', 106, 36)
('Male', 107, 20)
('Female', 108, 98)
('Male', 109, 85)
('Female', 110, 69)
('Male', 111, 46)
('Female', 112, 66)
('Male', 113, 91)
('Male', 114, 48)
('Male', 115, 56)
('Female', 116, 67)
('Male', 117, 78)
('Male', 118, 89)
('Male', 119, 32)
('Female', 120, 44)

# Primary Key---must have two constraints: unique and not null

==>It is a column that accepts unique values for each row.
==>Primary keys must contain UNIQUE values, and cannot contain NULL values. 
==>A table can have only ONE primary key; and in the table, this primary key can consist of single or multiple columns        (fields).

# NULL

A null value indicates a lack of a value, which is not the same thing as a value of zero:
Explain:
   If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value. 
   
For example, consider the question "How many books does Adam own?" The answer may be "zero" (we know that he owns none) or "null" (we do not know how many he owns).

# Not Null-- no blank values can be inserted in table.

The NOT NULL constraint enforces a column to not accept NULL values, which means that you cannot insert or update a record without adding a value to this field.

For example: SELECT * FROM employees WHERE last_name IS NOT NULL; This SQL Server IS NOT NULL example will return all records from the employees table where the last_name does not contain a null value.

In [135]:
import sqlite3 
db= sqlite3.connect("D:/MySQLite_DataBase/sports_database.db")
cur=db.cursor()

 #db = sqlite3.connect("D:/MySQLite_DataBase/scores_database.db")

contraints---
unique--- enter only unique values, no duplicate values.
not null--- no blank values can be inserted in table.

In [136]:
cur.execute("create table sport(id int primary key, sportname text unique, dateofevent date, country text not null)")

In [137]:
cur.execute("insert into sport values(1, 'cricket', '2021-11-9', 'England')")

In [138]:
#this line will throw error as sportname is duplicate  ------unique contraint failed

cur.execute("insert into sport values(2, 'cricket', '2018-08-02', 'SriLanka')")

IntegrityError: UNIQUE constraint failed: sport.sportname

In [139]:
cur.execute("insert into sport values(2, 'Tennis', '2018-08-02', 'SriLanka')")

In [140]:
result = cur.execute('select * from sport')
result.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'SriLanka')]

In [141]:
# This query throw error: not null constraint : can not leave any filled blank

cur.execute("insert into sport values(3, 'Football', '2022-05-30', NULL)")

IntegrityError: NOT NULL constraint failed: sport.country

# Employee database with DB and Python Programmatically

In [149]:
import sqlite3

In [150]:
con = sqlite3.connect("D:/MySQLite_DataBase/emp_database.db")

#created the table

In [ ]:
#user defined function
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key, name text, salary real, department text, position text, hiredate)")
    con.commit()
    
sql_table(con)

# When you need to delete the unwanted table

In [152]:
cur=con.cursor()
cur.execute("drop table employee")

con.commit()
sql_table(con)

# Example

In [153]:
con = sqlite3.connect("D:/MySQLite_DataBase1/emp_database.db")

OperationalError: unable to open database file

Here inside the user defined function we are passing the connection (con). 

connection is required as a parameter which is going to connect into emp_database or database.

In [154]:
#user defined function
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee1(id integer primary key, name text, salary real, department text, position text, hiredate)")
    con.commit()

In [155]:
#calling function

sql_table(con)

In [156]:
cur=con.cursor()
cur.execute("insert into employee1 values(1, 'Jack',9000,'HR','Manager','2019-07-09')")

In [157]:
con.commit()

In [158]:
results=cur.execute("select * from employee1")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

We can also pass values/arguments to an INSERT statement in the execute() method. You can use the question mark(?) as a placeholder or each  value. The syntax of the INSERT will be like the following:

cur.execute('''insert into employee(id, name, salary, department, position, hiredate) values(?,?,?,?,?,?,?)''', entities)

entities=(2, 'John', 4000,'IT','Engineer','2015-04-06')

In [159]:
def sql_insert(con, entities):
    cur=con.cursor()
    cur.execute('insert into employee1(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)', entities)

In [160]:
entities = (2,'Andrew',7000,'IT','Engineer','2015-04-06')

In [161]:
#calling sql insert to insert the data

sql_insert(con, entities)

In [162]:
entities = (3,'Thomas',6000,'HR','Manager','2016-06-14')

sql_insert(con, entities)

In [163]:
results = cur.execute("select * from employee1")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [164]:
entities = (4,'Rudolf',8000,'IT','Engineer','2012-02-23')
sql_insert(con, entities)
entities = (5,'Rudolf',10000,'Sales','Sales Executive','2018-02-19')

sql_insert(con, entities)

In [165]:
results = cur.execute("select * from employee1")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-02-23'),
 (5, 'Rudolf', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

# Delete from table employee1

In [166]:
sql = "delete from employee1 where id IN(4,5)"
cur.execute(sql)
results = cur.execute("select * from employee1")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [167]:
results= cur.execute("select id, name from employee1")

results.fetchall()

[(1, 'Jack'), (2, 'Andrew'), (3, 'Thomas')]

In [168]:
results = cur.execute("select id,name from employee1 where salary>8000")
results.fetchall()

[(1, 'Jack')]

In [169]:
results= cur.execute("select id,name from employee1 where department in ('HR')")
results.fetchall()

[(1, 'Jack'), (3, 'Thomas')]

In [170]:
results = cur.execute("select min(salary) from employee1")
results.fetchone()

(6000.0,)

In [171]:
results = cur.execute("select count(id) from employee1")
results.fetchone()

(3,)

# distinct:

#unique Vs Distinct

The DISTINCT keyword in the SELECT clause is used to eliminate duplicate rows and display a unique list of values. In other words, the DISTINCT keyword retrieves unique values from a table.

The UNIQUE keyword in SQL plays the role of a database constraint; it ensures there are no duplicate values stored in a particular column or a set of columns.

In [172]:
results = cur.execute("select distinct(department) from employee1")
results.fetchall()

[('HR',), ('IT',)]

In [173]:
results = cur.execute("select count(distinct(department)) from employee1")
results.fetchall()

[(2,)]

# GROUP BY

The SQL GROUP BY clause is used in collaboration with the SELECT statement to arrange identical data into groups. This GROUP BY clause follows the WHERE clause in a SELECT statement and precedes the ORDER BY clause.

Syntax:

SELECT column1, column2 FROM table_name WHERE [ conditions ] GROUP BY column1, column2 ORDER BY column1, column2

The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".

The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

In [174]:
results = cur.execute("select sum(salary), position from employee1 group by position")
results.fetchall()

[(7000.0, 'Engineer'), (15000.0, 'Manager')]

In [175]:
results=cur.execute("select sum(salary), department from employee1 group by department")
results.fetchall()

[(15000.0, 'HR'), (7000.0, 'IT')]

In [176]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [177]:
#make query
sql="select * from employee1"

#pass query in function
respond =sql_query(sql)
respond.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [178]:
sql = "select id,name, position from employee1"

#pass query in function
respond = sql_query(sql)
respond.fetchall()

[(1, 'Jack', 'Manager'), (2, 'Andrew', 'Engineer'), (3, 'Thomas', 'Manager')]

# Having

Having:
While the GROUP BY Clause groups rows that have the same values into summary rows. The having clause is used with the where clause in order to find rows with certain conditions. The having clause is always used after the group By clause.

Syntax:

SELECT column1, column2 FROM table_name WHERE [ conditions ] GROUP BY column1, column2 HAVING [ conditions ]

In [179]:
results=cur.execute("select sum(salary), department from employee1 group by department having sum(salary)>10000")
results.fetchall()

[(15000.0, 'HR')]

# Foreign key

A foreign key can refer to either a unique or a primary key value of the parent table. If the foreign key refers to a non-primary unique key, we must specify the column names of the key explicitly.

The table with the foreign key is called the child table, and the table with the primary key is called the referenced or parent table.

Referential integrity refers to the relationship between tables.

In [180]:
import sqlite3
db=sqlite3.connect("D:/MySQLite_DataBase/student_course_database.db")

In [181]:
cur=db.cursor()

In [182]:
cur.execute("create table course(course_id int primary key,course_name text, duration int)")

In [183]:
cur.execute("create table student(roll_no int primary key,student_name text, age int, course_id int, foreign key(course_id) references course(course_id))")

In [184]:
cur.execute("insert into course values(78,'Data Science',12),(56,'Python Course',4),(101,'DataBase',7)")

print(cur.rowcount,"record(s) inserted")

db.commit()

3 record(s) inserted

In [185]:
cur.execute("insert into student values(1, 'Jack', 22, 78),(2,'John',21,56),(3,'Rudolf',18,78),(4,'Jim',21,56)")

print(cur.rowcount,"record(s) inserted")

db.commit()

4 record(s) inserted

In [186]:
results = cur.execute("select * from course")

for i in results:
    print(i)

(78, 'Data Science', 12)
(56, 'Python Course', 4)
(101, 'DataBase', 7)

In [187]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Jack', 22, 78)
(2, 'John', 21, 56)
(3, 'Rudolf', 18, 78)
(4, 'Jim', 21, 56)

In [188]:
result =cur.execute('select course_id from course where course_name = "Data Science"')

for i in results:
    print(i)

(78,)

# Subquery

A subquery is a query that appears inside another query statement. Subqueries are also referred to as sub- SELECT s or nested SELECT s. The full SELECT syntax is valid in subqueries.

==> outer_query = inner_query

==>Inner querry will be executed first then outer query will be executed.

"select * from student where course_id=(select course_id from course where course_name ='Data Science')"

In [189]:
results=cur.execute("select * from student where course_id=(select course_id from course where duration =4)")

results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

In [190]:
results=cur.execute("select * from student where course_id=(select course_id from course where duration =4)")

results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

# Union

The UNION operator is used to combine the data from the result of two or more SELECT command queries into a single distinct result set. This operator removes any duplicates present in the results being combined.

# Join

#### To know the source directory of pc

In [191]:
import os
cwd=os.getcwd()
cwd

'C:\\Users\\Asus'

Join clause is used to combine records from two or more tables in a database.

Different Types of SQL JOINs
Here are the different types of the JOINs in SQL:

(INNER) JOIN: Returns records that have matching values in both tables

LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

<img src="join.png">

# Format to paste image in jupyter notebook

<img src="join.png" style="width:380px;height:224px"> 

style statement depends on requirement. this is not mindatroy.

Note: Image should be in source directory else in uploaded in jupyter source.

# Inner Join

Inner Join creates a new result table by com bining column values of two tables (table_1 and table_2) based upon the join_predicate.

In [192]:
sql="select student.roll_no, student.student_name, course.course_id, course.course_name from student INNER JOIN course On student.course_id =course.course_id"
results=cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (2, 'John', 56, 'Python Course'),
 (3, 'Rudolf', 78, 'Data Science'),
 (4, 'Jim', 56, 'Python Course')]

# LEFT JOIN

##### When left table is student

In [193]:
sql="select student.roll_no, student.student_name, course.course_id, course.course_name from student LEFT JOIN course On student.course_id =course.course_id"
results=cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (2, 'John', 56, 'Python Course'),
 (3, 'Rudolf', 78, 'Data Science'),
 (4, 'Jim', 56, 'Python Course')]

##### when left table is course

In [194]:
sql="select student.roll_no, student.student_name, course.course_id, course.course_name from course LEFT JOIN student On student.course_id =course.course_id"
results=cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (3, 'Rudolf', 78, 'Data Science'),
 (2, 'John', 56, 'Python Course'),
 (4, 'Jim', 56, 'Python Course'),
 (None, None, 101, 'DataBase')]

Both quey have different results

# Note:--- Right join and full outer join are does not support by sqlite.